Changed doc to puml
Co-authored-by: Copilot <copilot@github.com>
